#include "menu.h"
#include "tools/color.h"
#include <iostream>

static const char *BANNER = "\
\t__          ___           _          __  __            _        _       _\n\
\t\\ \\        / / |         | |        |  \\/  |          | |      | |     | |\n\
\t \\ \\  /\\  / /| |__   __ _| | ___    | \\  / | __ _ _ __| | _____| |_    | |\n\
\t  \\ \\/  \\/ / | '_ \\ / _` | |/ _ \\   | |\\/| |/ _` | '__| |/ / _ \\ __|   | |\n\
\t   \\  /\\  /  | | | | (_| | |  __/   | |  | | (_| | |  |   <  __/ |_    |_|\n\
\t    \\/  \\/   |_| |_|\\__,_|_|\\___|   |_|  |_|\\__,_|_|  |_|\\_\\___|\\__|   (_)\n\
";

void welcomeMessage()
{
    printf("\n%s%sWelcome to%s\n", BOLD, FRONT_RED, RESET);
    printf("%s%s%s%s\n", FRONT_BLUE, BOLD, BANNER, RESET);
    printf("%sThis is WinterCode Project for C-Beginners.%s\n\n", FRONT_PURPLR, RESET);
}

void initialMenu()
{
    std::cout << "=============================================================" << std::endl;
    std::cout << "1.用户登录\t2.用户注册\t3.管理员登录\t4.退出程序" << std::endl;
    std::cout << "=============================================================" << std::endl;
}

void adminMenu()
{
    std::cout << "================================================================================================" << std::endl;
    std::cout << "1.查看所有商品\t2.搜索商品\t3.查看所有订单\t4.查看所有用户\t5.删除用户\t6.下架商品\t7.注销" << std::endl;
    std::cout << "================================================================================================" << std::endl;
    std::cout << "输入操作:";
}

void userMenu()
{
    std::cout << "=============================================================" << std::endl;
    std::cout << "1.注销登录\t2.我是买家\t3.我是卖家\t4.个人信息管理" << std::endl;
    std::cout << "=============================================================" << std::endl;
    std::cout << "输入操作:";
}

void userModifyMenu()
{
    std::cout << "=============================================================" << std::endl;
    std::cout << "1.返回用户主界面\t2.修改信息\t3.查看信息\t4.充值" << std::endl;
    std::cout << "=============================================================" << std::endl;
    std::cout << "输入操作:";
}

void sellerMenu()
{
    std::cout << "=============================================================" << std::endl;
    std::cout << "1.发布商品\t2.查看发布商品\t3.修改商品信息\t4.下架商品\t5.查看历史订单\t6.返回用户主界面" << std::endl;
    std::cout << "=============================================================" << std::endl;
    std::cout << "输入操作:";
}
void buyerMenu()
{
    std::cout << "=============================================================" << std::endl;
    std::cout << "1.查看商品列表\t2.购买商品\t3.搜索商品\t4.查看历史订单\t5.查看商品详细信息\t6.返回用户主界面" << std::endl;
    std::cout << "=============================================================" << std::endl;
    std::cout << "输入操作:";
}
